hhtbing-wisefido/pose-radar-ti/project-code/AWRL6844_HealthDetect/src/dss/xwrL684x-evm/c66ss0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "XWRL684X" --part "Default" --package "FCCSP" --context "c66ss0" --product "MMWAVE-L-SDK-6@06.01.00.01"
 * @v2CliArgs --device "AWRL6844" --package "FCCSP (ANC)" --context "c66ss0" --product "MMWAVE-L-SDK-6@06.01.00.01"
 * @versions {"tool":"1.26.0+4000"}
 */

/**
 * Health Detection Project - DSS SysConfig
 *
 * Reference: AWRL6844_InCabin_Demos/src/dss/xwrL684x-evm/c66ss0_freertos/example.syscfg
 *
 * Created: 2026-01-08
 */

/**
 * Import the modules used in this configuration.
 */
const ipc       = scripting.addModule("/drivers/ipc/ipc");
const cache_c6x = scripting.addModule("/kernel/dpl/cache_c6x");
const clock     = scripting.addModule("/kernel/dpl/clock");
const debug_log = scripting.addModule("/kernel/dpl/debug_log");

/**
 * Write custom configuration values to the imported modules.
 */

/* L1P Cache Size: 16KB */
cache_c6x.l1psize = 16;

/* L1D Cache Size: 16KB */
cache_c6x.l1dsize = 16;

/* MAR Region Configuration for L3 Memory
 * Enable caching and prefetch for the L3 shared memory region
 * This improves performance for DSS accessing shared radar cube data
 */
cache_c6x.marRegionConfig.create(1);
cache_c6x.marRegionConfig[0].$name          = "kernel_dpl_cache_c6x_mar0";
cache_c6x.marRegionConfig[0].baseAddr       = 0x88000000;
cache_c6x.marRegionConfig[0].enableCache    = true;
cache_c6x.marRegionConfig[0].enablePrefetch = true;

/* DSP Clock Frequency: 400MHz */
clock.DSPClockFreq = "SOC_C66CoreFreq400MHz";
